# 22.Найти сумму чисел списка стоящих на нечетной позиции

s = [12, 34, 342, 45, 455, 23]


def summ(s):
    sum = 0
    for i in range(1, len(s), 2):
        sum += s[i]
    return sum


print(f'Сумма чисел списка, стоящих на нечетной позиции = {summ(s)}')
